#+begin_src C :results output
  #include <math.h>
  #include <stdio.h>

  #define  num_slots 10
  static int numbers[] = {1, 2, 3, 4, 5, 7, 8, 9, 10, 11};

  int sum_array(int num_opts, int numbers[num_opts]){
    int total=0;
    for (int i=0; i < num_opts; i++)
      total+=numbers[i];
  }

  int int_sqrt(int input){
    int power=0, copy = input;
    while (1 < copy){
      copy >>= 1;
      power++;
    }
    return power;
  }

  void printBits(unsigned int num)
  {
    for(int bit=0;bit<(sizeof(unsigned int) * 8); bit++)
      {
        printf("%i", num & 0x01);
        num = num >> 1;
      }
  }

  int make_subgroups(int inputs[num_slots]){
    
    int i, j;
    int combos = (int)powl(2, num_slots);
    int options[combos];
    
    for (i=0; i < combos; i++)
      options[i] = 0;
    for (i=0; i < num_slots; i++){
      options[1 << i] = inputs[i];
    }

    for (i=0; i < 50; i++){
      printf("%d -> ", i);
      printBits(i);
      printf(" -> %d\n", options[i]);
    }
    
    for (i=0; i < combos; i++){
      if (i == (1 << int_sqrt(i)))
        continue;
      for (j=0; j < num_slots; j++)
        options[i] += options[i & (1 << j)];
    }

    printf("---------------------\n");
    for (i=0; i < 50; i++){
      printf("%d -> ", i);
      printBits(i);
      printf(" -> %d\n", options[i]);
    }
  }

    /* printf("%d\n", int_sqrt(1)); */
  make_subgroups(numbers);

#+end_src

#+RESULTS:
#+begin_example
0 -> 00000000000000000000000000000000 -> 0
1 -> 10000000000000000000000000000000 -> 1
2 -> 01000000000000000000000000000000 -> 2
3 -> 11000000000000000000000000000000 -> 0
4 -> 00100000000000000000000000000000 -> 3
5 -> 10100000000000000000000000000000 -> 0
6 -> 01100000000000000000000000000000 -> 0
7 -> 11100000000000000000000000000000 -> 0
8 -> 00010000000000000000000000000000 -> 4
9 -> 10010000000000000000000000000000 -> 0
10 -> 01010000000000000000000000000000 -> 0
11 -> 11010000000000000000000000000000 -> 0
12 -> 00110000000000000000000000000000 -> 0
13 -> 10110000000000000000000000000000 -> 0
14 -> 01110000000000000000000000000000 -> 0
15 -> 11110000000000000000000000000000 -> 0
16 -> 00001000000000000000000000000000 -> 5
17 -> 10001000000000000000000000000000 -> 0
18 -> 01001000000000000000000000000000 -> 0
19 -> 11001000000000000000000000000000 -> 0
20 -> 00101000000000000000000000000000 -> 0
21 -> 10101000000000000000000000000000 -> 0
22 -> 01101000000000000000000000000000 -> 0
23 -> 11101000000000000000000000000000 -> 0
24 -> 00011000000000000000000000000000 -> 0
25 -> 10011000000000000000000000000000 -> 0
26 -> 01011000000000000000000000000000 -> 0
27 -> 11011000000000000000000000000000 -> 0
28 -> 00111000000000000000000000000000 -> 0
29 -> 10111000000000000000000000000000 -> 0
30 -> 01111000000000000000000000000000 -> 0
31 -> 11111000000000000000000000000000 -> 0
32 -> 00000100000000000000000000000000 -> 7
33 -> 10000100000000000000000000000000 -> 0
34 -> 01000100000000000000000000000000 -> 0
35 -> 11000100000000000000000000000000 -> 0
36 -> 00100100000000000000000000000000 -> 0
37 -> 10100100000000000000000000000000 -> 0
38 -> 01100100000000000000000000000000 -> 0
39 -> 11100100000000000000000000000000 -> 0
40 -> 00010100000000000000000000000000 -> 0
41 -> 10010100000000000000000000000000 -> 0
42 -> 01010100000000000000000000000000 -> 0
43 -> 11010100000000000000000000000000 -> 0
44 -> 00110100000000000000000000000000 -> 0
45 -> 10110100000000000000000000000000 -> 0
46 -> 01110100000000000000000000000000 -> 0
47 -> 11110100000000000000000000000000 -> 0
48 -> 00001100000000000000000000000000 -> 0
49 -> 10001100000000000000000000000000 -> 0
---------------------
0 -> 00000000000000000000000000000000 -> 0
1 -> 10000000000000000000000000000000 -> 1
2 -> 01000000000000000000000000000000 -> 2
3 -> 11000000000000000000000000000000 -> 3
4 -> 00100000000000000000000000000000 -> 3
5 -> 10100000000000000000000000000000 -> 4
6 -> 01100000000000000000000000000000 -> 5
7 -> 11100000000000000000000000000000 -> 6
8 -> 00010000000000000000000000000000 -> 4
9 -> 10010000000000000000000000000000 -> 5
10 -> 01010000000000000000000000000000 -> 6
11 -> 11010000000000000000000000000000 -> 7
12 -> 00110000000000000000000000000000 -> 7
13 -> 10110000000000000000000000000000 -> 8
14 -> 01110000000000000000000000000000 -> 9
15 -> 11110000000000000000000000000000 -> 10
16 -> 00001000000000000000000000000000 -> 5
17 -> 10001000000000000000000000000000 -> 6
18 -> 01001000000000000000000000000000 -> 7
19 -> 11001000000000000000000000000000 -> 8
20 -> 00101000000000000000000000000000 -> 8
21 -> 10101000000000000000000000000000 -> 9
22 -> 01101000000000000000000000000000 -> 10
23 -> 11101000000000000000000000000000 -> 11
24 -> 00011000000000000000000000000000 -> 9
25 -> 10011000000000000000000000000000 -> 10
26 -> 01011000000000000000000000000000 -> 11
27 -> 11011000000000000000000000000000 -> 12
28 -> 00111000000000000000000000000000 -> 12
29 -> 10111000000000000000000000000000 -> 13
30 -> 01111000000000000000000000000000 -> 14
31 -> 11111000000000000000000000000000 -> 15
32 -> 00000100000000000000000000000000 -> 7
33 -> 10000100000000000000000000000000 -> 8
34 -> 01000100000000000000000000000000 -> 9
35 -> 11000100000000000000000000000000 -> 10
36 -> 00100100000000000000000000000000 -> 10
37 -> 10100100000000000000000000000000 -> 11
38 -> 01100100000000000000000000000000 -> 12
39 -> 11100100000000000000000000000000 -> 13
40 -> 00010100000000000000000000000000 -> 11
41 -> 10010100000000000000000000000000 -> 12
42 -> 01010100000000000000000000000000 -> 13
43 -> 11010100000000000000000000000000 -> 14
44 -> 00110100000000000000000000000000 -> 14
45 -> 10110100000000000000000000000000 -> 15
46 -> 01110100000000000000000000000000 -> 16
47 -> 11110100000000000000000000000000 -> 17
48 -> 00001100000000000000000000000000 -> 12
49 -> 10001100000000000000000000000000 -> 13
#+end_example



#+begin_src C :results output
  #include <math.h>
  #include <stdio.h>

  #define  num_slots 10
  static int numbers[] = {1, 2, 3, 4, 5, 7, 8, 9, 10, 11};

  int sum_array(int num_opts, int numbers[num_opts]){
    int total=0;
    for (int i=0; i < num_opts; i++)
      total+=numbers[i];
  }

  int int_sqrt(int input){
    int power=0, copy = input;
    while (1 < copy){
      copy >>= 1;
      power++;
    }
    return power;
  }

  void printBits(unsigned int num)
  {
    for(int bit=0;bit<(sizeof(unsigned int) * 8); bit++)
      {
        printf("%i", num & 0x01);
        num = num >> 1;
      }
  }

  int make_subgroups(int inputs[num_slots]){
    
    int i, j;
    int combos = (int)powl(2, num_slots);
    int options[combos];
    
    for (i=0; i < combos; i++)
      options[i] = 0;
    for (i=0; i < num_slots; i++){
      options[1 << i] = inputs[i];
    }

    for (i=0; i < 50; i++){
      printf("%d -> ", i);
      printBits(i);
      printf(" -> %d\n", options[i]);
    }
    
    for (i=0; i < combos; i++){
      int lead = 1 << int_sqrt(i);
      int rest =  ~lead;
      options[i] = options[i & lead] + options[i & rest];
    }

    printf("---------------------\n");
    for (i=0; i < 50; i++){
      printf("%d -> ", i);
      printBits(i);
      printf(" -> %d\n", options[i]);
    }
  }

    /* printf("%d\n", int_sqrt(1)); */
  make_subgroups(numbers);

#+end_src
